# типы данных в питоне 

# 1. NoneType - Ничего, пустота -> None;

# 2. Boolean - True or False (Истинна или ложь);

# 3. str() - Строки -> "Hello world", 'The same';

# 4. Числовой тип данных:
#   a. integer - int() - целое число (-1, 0, 3);
#   b. float() - число с плавающей точкой (1.2, 0,15);
#   c. complex() - Комплексные числа (3+5i6);

# 5. Списковые типы данных:
# a. list(список/массив) -> [1, 2, 3, None, 'Hello', True, []];
#   b. tuple(кортеж) -> (1, 2, 3, None);
#   c. range(последовательность) -> range(1, 10);

# 6. set() -> множества;

# 7. dict(словари) -> содержат данные в виде ключа и значения -> {1: 'One', 2; 'Two'};

# mutable(изменяемые типы данных)
# 1. list
# 2. set
# 3. dict

# Immutable(Неизменяемые типы данных)
# 1. NoneType
# 2. Boolean
# 3, Int, float, complex
# 4. str
# 5. range
# 6. turple
# 7. frozenset

""" 
стандартный вывод данных
В пайтоне для вывода данных в терминал используется встроенная функция print()

"""
# print('Hello world! every day')
# print(27+5)

""" 
стандартный ввод данных через терминал используется функция input()
"""
# a = input("Введите число: ")
# print("В а хранится: ", a)


# print(input("Введите свое имя: "))


